tap "browsh-org/browsh"
tap "github/gh"
tap "hacker1024/hacker1024"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "samtay/tui"
tap "teamookla/speedtest"
brew "aria2"
brew "bash"
brew "python@3.9"
brew "cmatrix"
brew "cointop"
brew "composer"
brew "coreutils"
brew "glances"
brew "gnu-sed"
brew "googler"
brew "libusbmuxd"
brew "mas"
brew "micro"
brew "midnight-commander"
brew "mono"
brew "mosh"
brew "mpd"
brew "neofetch"
brew "php"
brew "psutils"
brew "sampler"
brew "ssh-copy-id"
brew "swiftlint"
brew "thefuck"
brew "wget"
brew "wtfutil"
brew "xclip"
brew "samtay/tui/tetris"
brew "teamookla/speedtest/speedtest"
cask "blender"
cask "discord"
cask "figma"
cask "gimp"
cask "github"
cask "google-chrome"
cask "inkscape"
cask "intel-power-gadget"
cask "ngrok"
cask "openinterminal"
cask "opera"
cask "raspberry-pi-imager"
cask "spotify"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code-insiders"
mas "Developer", id: 640199958
mas "Ethernet Status", id: 1186187538
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Tab Suspender", id: 1495356253
mas "Xcode", id: 497799835
