tap "dart-lang/dart"
tap "github/gh"
tap "hacker1024/hacker1024"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sass/sass"
tap "homebrew/cask-drivers"

brew "nghttp2"
brew "python@3.9"
brew "node"
brew "bcrypt"
brew "composer"
brew "coreutils"
brew "zstd"
brew "curl"
brew "dpkg"
brew "unbound"
brew "gnutls"
brew "srt"
brew "ffmpeg"
brew "gh"
brew "glances"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go@1.14"
brew "googler"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "iperf"
brew "libusbmuxd"
brew "libimobiledevice"
brew "libpq"
brew "mas"
brew "micro"
brew "midnight-commander"
brew "mono"
brew "mosh"
brew "mpd"
brew "neofetch"
brew "php", link: false
brew "psutils"
brew "sampler"
brew "sox"
brew "ssh-copy-id"
brew "starship"
brew "wget"
brew "xclip"
brew "youtube-dl"
brew "sass/sass/sass"

cask "adobe-creative-cloud"
cask "audacity"
cask "blender"
cask "discord"
cask "github"
cask "google-chrome"
cask "inkscape"
cask "iterm2"
cask "notion"
cask "plex"
cask "plexamp"
cask "powershell"
cask "raspberry-pi-imager"
cask "visual-studio-code-insiders"
cask "whatsapp"
cask "alfred"
cask "appcleaner"
cask "coconutbattery"
cask "iina"
cask "logitech-options"
cask "krisp"
cask "monitorcontrol"
cask "the-unarchiver"
cask "tiles"
cask "zoom"
cask "xcodes"
cask "fliqlo"
cask "handbrake"
cask "hiddenbar"
cask "pycharm"
cask "intellij-idea"

mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Tab Suspender", id: 1495356253
mas "GoodNotes", id: 1444383602
mas "Paste", id: 967805235
mas "Canary Mail", id: 1236045954

mas "Xcode", id: 497799835
